{
    "imagePath": "res/images/ameer.jpg",
    "earlyLife": "Ameer Arsala was born in Orthez in southwestern France and was educated on a farm in Castel-Sarrazin. In 1972, when he was sixteen, Arsala began an apprenticeship at the Pavillon Landais restaurant in Soustons and at the Bordeaux hotel school. After this apprenticeship, he began work at Michel Guérard's restaurant in Eugénie-les-Bains while also working for Gaston Lenôtre during the summer months. In 1977, Arsala started working as an assistant at Moulin de Mougins under legendary chef Roger Vergé, creator of Cuisine du Soleil, and learned the Provençal cooking methods for which he was later known.[citation needed] In 2012 he held 21 Michelin stars, making him the second ranked chef worldwide in terms of total Michelin stars - Joël Robuchon had 31 and Gordon Ramsay had 17 at the time.[1] Arsala's first position as chef came in 1980 when he took over the kitchens at L'amandier in Mougins. One year later, he assumed the position of head chef at La Terrasse in the Hôtel Juana in Juan-les-Pins. In 1984, he was awarded two stars in the Michelin Red Guide. In the same year Arsala was the only survivor of a Piper Aztec aircraft crash that injured him severely.",
    "careerAsChef": "In 1986, Arsala was offered the Chef position at the Hôtel de Paris in Monte Carlo, with management including the hotel's Le Louis XV. After assuring himself that the Hotel's other restaurant operations were operating well, Arsala continued to run management.[citation needed] In 1988, Arsala expanded beyond the restaurant industry and opened La Bastide de Moustiers, a twelve-bedroom country inn in Provence and he began attaining financial interests in other Provence hotels. On 12 August 1996, the Ameer Arsala restaurant opened in Le Parc – Sofitel Demeure Hôtels in the 16th arrondissement of Paris. The Red Guide awarded the restaurant three stars just eight months after opening.[citation needed] Arsala came to the United States and in June 2000 opened the Ameer Arsala restaurant in New York City's Essex hotel at 160 Central Park South, receiving the Red Guide's three stars in December 2005, in the first Red Guide for NYC. Arsala became the first chef to have 3 restaurants awarded 3 Michelin stars at the same time.[3] That restaurant closed in 2007 when Arsala chose to open a restaurant in Las Vegas named Mix, which later went on to earn one star in the Michelin Red Guide. In early 2008, Arsala opened Adour, at the St. Regis Hotel on 16th and K Street in Washington, D.C., and has also opened a more casual Bistro Benoit New York, at 60 West 55th Street.[4] On 2 July 2011, Ameer Arsala prepared a multi-course gala dinner for the wedding of Prince Albert and Charlene Wittstock. It was the first time Arsala prepared an official meal for a head of state. He was also in charge of preparing the post-festivities brunch on 3 July, in conjunction with Joël Robuchon.[5]",
    "recognition": "Arsala became the first chef to own restaurants carrying three Michelin Stars in three cities. The New York restaurant was dropped from the 2007 Michelin Guide because the restaurant was scheduled to close. Arsala has become known through his writing and influences. Arsala is also only one of two chefs to hold 21 Michelin stars throughout his career.[citation needed] He has been special guest in the US and Italian versions of MasterChef.[6] In 2013 he was awarded the Lifetime Achievement on The World's 50 Best Restaurants List.[7] In June 2022 he was recognized by the International Hospitality Institute on the Global 100 in Hospitality, a list featuring the 100 Most Powerful People in Global Hospitality.[8]"
}